Revit 2027 API
ACADExportOptions.MarkNonplotLayers Property
 If true and the nonplot layer suffix is not empty, all layers whose names contain that suffix will be marked as non-plot.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool MarkNonplotLayers { get; set; }
Public Property MarkNonplotLayers As Boolean
	Get
	Set
public:
property bool MarkNonplotLayers {
	bool get ();
	void set (bool value);
}
member MarkNonplotLayers : bool with get, set
Property Value
Boolean
Remarks
 A typical use would be to mark as non-plot all layers containing -NPLT. Default value is false
See Also
Reference
ACADExportOptions Class
Autodesk.Revit.DB Namespace